[
    {
        "title": "Global Health Technologies (SUTD TAE)",
        "description": "This course is not offered in 2020.\nGlobal Health Technologies course provides a multi-disciplinary approach to global health technology design using real world projects and partners. The course explores the current state of global health challenges (with special focus on Singapore and her neighbours), and teaches students how to design medical technologies (e.g. products, systems) that address these problems. The same technology that is applicable in developing countries will be tested in Singapore as a pilot run, before being introduced to the neighboring countries. In their respective project groups, students will brainstorm and define current elderly issues pertaining to community hospitals (e.g. St Andrew’s Community Hospital) in Singapore. Guest lectures, panel discussions and organized field trip will allow student to have a first-hand experience to global health issues and help students come up with better solutions. The Biodesign Innovation process will be taught and applied in the student projects.",
        "subject_code": "01.101",
        "type": "EPD",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "Introduction and overview of engineering management. Financial principles, management of innovation, technology strategy, and best management practices. Cases are discussed in class for class participation. Focus is on the development of individual skills and team work, and exposure to management tools.",
        "subject_code": "01.106",
        "title": "Engineering Management",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "This course introduces innovative product design methods and techniques in the crosscultural contexts. In this course, we focus on consumer products (used or consumed by ordinary end users rather than professionals), including physical products and computer software.  The first part of the course will introduce empathetic design approach, targeting at designing for niche market. Using this artistic approach, designers is mainly driven by their intrinsic motivations. Some techniques of design semiotics will be taught and students are expected to do some souvenir design on the basis of Singaporean cultural elements.  The second part targets at cross-cultural design for the mass market. In collaboration with Alibaba international UED team, we will explore an emerging virtual place for intercultural communication and interactions, mobile commerce applications (m-Commerce apps). In this case, designs are mainly driven by extrinsic requirements. How to understand and response to users from different cultural backgrounds will be a huge challenge for designers. Students will be guided to detach from their own cultural viewpoints, and be sensitive to intercultural differences. Equipped with basic marketing and user study techniques, students are required to do a cross-cultural analysis for products or mobile apps. The insights gained from the cross-cultural user studies will then guide students to finish their course project: designing a cross-cultural m-Commerce app.",
        "subject_code": "01.111",
        "title": "Culture Formation and Innovative Product Design",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Capstone 1",
        "description": "Students develop an understanding of engineering product development process and experience through working in teams to design and construct product prototypes. In this experience the design process is placed into a broader development context. Aspects addressed include the engineering reasoning, assessment of design alternatives, modeling techniques for different development phases, transforming customer information into engineering specifications, oral and written communication, and teamwork as a necessary part of resolving the challenges in designing and building a substantive product prototype.",
        "type": "EPD",
        "subject_code": "01.400",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "01.401",
        "title": "Capstone 2",
        "type": "EPD",
        "description": "Students develop an understanding of engineering product development process and experience through working in teams to design and construct product prototypes. In this experience the design process is placed into a broader development context. Aspects addressed include the engineering reasoning, assessment of design alternatives, modeling techniques for different development phases, transforming customer information into engineering specifications, oral and written communication, and teamwork as a necessary part of resolving the challenges in designing and building a substantive product prototype.",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "What are we? How do we know what we know? What really exists? Are we intrinsically good? How should society function? What is moral?\nThis course takes such perennial questions in human history and explores them from the perspective of some of\nAsia’s greatest minds. It focuses on understanding the central tenets of Buddhism, Hinduism, Daoism, and Confucianism and traces their later developments up until the fifteenth century. In doing so it provides an introduction to the main religious and philosophical traditions of India and China. On account of the parallels and exchanges between their respective intellectual traditions, the course weaves between Chinese and Indian thinkers in order to encourage comparison and cross-cultural conversations.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.105DH",
        "title": "Sages Through The Ages: Readings in Early Indian and Chinese Religion and Philosophy",
        "type": "HASS",
        "instructor_first_name": "Alastair",
        "instructor_last_name": "Gornall"
    },
    {
        "description": "This course introduces the origin, development and the basic features of traditional Chinese short stories from Spring and Autumn and the Warring States Periods to the 18th century. Texts include historical writings, supernatural and fantastic tales, Tang-Song romance, Buddhist bian-wen and Ming-Qing vernacular stories. The course will focus on the basics of literary and cultural history, with attention given to narrative structure, popular character types and themes in traditional Chinese short fictions, as well as adaptation of traditional short fiction in contemporary Chinese cinema.\nAll readings are in English translation.  No previous knowledge of Chinese literature or the Chinese language is required.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "title": "History of Traditional Chinese Short Fiction",
        "type": "HASS",
        "subject_code": "02.120DH",
        "instructor_first_name": "Zhao",
        "instructor_last_name": "Zhenxing"
    },
    {
        "description": "Even after seven decades, Singapore abounds with personal and institutional memories of the Japanese Occupation. The brief occupation of Southeast Asia (1941-45) during WWII was a complex phenomenon involving the complicity of many Asian nationalist leaders. While it did contribute to the unravelling of European colonial rule, it was at a tragic human cost, the ethics and gore of which are still debated both in academia and in popular media. Through scholarly texts, memoirs, fiction film (The Burmese Harp, Bridge on the River Kwai) and archival newsreels, this course will explore those tumultuous years in Burma, Indochina, Malaya, Indonesia, and the Philippines. We will read and discuss books and diaries, watch films, debate historical perspectives, take a field trip to the new exhibition at the Ford Motor factory, and reflect on the lingering aspects of the Occupation.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "title": "Southeast Asia Under Japan: Motives, Memoirs, and Media",
        "subject_code": "02.126",
        "type": "HASS",
        "instructor_first_name": "Sandeep",
        "instructor_last_name": "Ray"
    },
    {
        "type": "HASS",
        "description": "This class will explore the long and lively literary and artistic tradition in which Satan figures as both spiritual antagonist and co-conspirator. During the term, we’ll track the figure of Satan in the Western world, from Genesis to Roman Polanski’s films—with substantial time dedicated to discussions of Milton’s epic poem about the Fall, Paradise Lost.\nWe’ll begin with some of the world’s oldest texts containing the story of Satan’s temptation of Adam and Eve; these scriptural and apocryphal works span the Judeo-Christian and Islamic traditions. The remainder of the semester will provide you with opportunities to read some of the most powerful responses to these stories about humankind’s Fall from divine grace—with a focus on authors and artists from England, America, and Russia. We’ll discuss the implication of the reimagined Satan’s role as an avatar or mouthpiece for the religious, sexual, political, or racial anxieties of his specific historical epoch. In the process, we’ll ask how Satan—as archetype and personae—contributes to each of these meditations about human shortcoming, erotic longing, the quest for knowledge, and unbridled ambition. Whether as arch-enemy, Vice figure, Machiavellian villain, tragic hero, romantic idealist, intellectual skeptic, or as a facet of oneself, Satan—reimagined in two millennia of visual art, literature, and culture—embodies the qualities that strike us foremost as distinctly humane.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "title": "Satan and His Afterlives in Literature and Film",
        "subject_code": "02.127DH",
        "instructor_first_name": "Rhema",
        "instructor_last_name": "Hokama"
    },
    {
        "description": "What are the differences between documentary, ethnographic and non-fiction films? Can a ‘documentary’ have actors in it? How does archival footage play a role in the re-construction of events? Can one make a ‘real’ documentary film with a smart phone? This course provides an overview of the evolution and practice of non-fiction cinema and trains students both in film appreciation and production. We shall critically analyze the development of this shape-shifting genre over the past hundred years and consider the significance of this cinematic form in contemporary society. Ethnographic theory will be utilized toward a practical application (making a film), and contextualized within emerging trends in the Digital Humanities. Cinema-verite filming, 3-point interview lighting, the use of archival footage, and sound recording techniques will be taught in workshop styled classes.\nRequirement\nStudents who wish to take enrol in this course (with the exception of those in Term 7 and DH Minors) are required to submit a brief response to the instructor:\nWhy do you wish to take this class? (Please list any past experience in video production or in visual studies if applicable).\n*Note: This course will be conducted physically in campus.",
        "title": "Non‐Fiction and Ethnographic Film: Theory and Practice",
        "type": "HASS",
        "subject_code": "02.131DH",
        "instructor_first_name": "Sandeep",
        "instructor_last_name": "Ray"
    },
    {
        "description": "In this class, we’ll read short poems spanning 500 years of modernity—from the Renaissance sonnet to the 21st century Twitter poem. The focus of this class is tripartite: first, it provides students with an opportunity to explore the role that poetry has played in modern society and culture. To this end, we’ll read practicing poets on the purposes of poetry—from Sir Philip Sidney to contemporary Singaporean poets.\nAdditionally, we’ll also look at the way poets from a range of cultures and historical moments have used poetry to comment upon questions of perennial importance. Can poems help us think about what it means to create a well-run city? And how we can live a flourishing life? In weekly modules, we will read about three to five poets on topics such as the roles of children and parents, an individual’s place within the family and the city, love, religion, politics, and technology. The majority of these poems will be written in English, with a few in translation from Chinese, Malay, Tamil, and other languages.\nFinally, we’ll also discuss the formal features of poetry—with lessons on prosody, form, meter, rhyme, tone, and imagery. These features constitute what an engineering student might term the “architectural and design studies” of poetry. We’ll study the formal structures and techniques that enable poems to convey meaning—what the poet Marianne Moore calls “a place for the genuine.”\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.136DH",
        "title": "Lyric Poetry",
        "type": "HASS",
        "instructor_first_name": "Rhema",
        "instructor_last_name": "Hokama"
    },
    {
        "subject_code": "02.143DH",
        "title": "Artificial Intelligence and Ethics",
        "type": "HASS",
        "description": "The advances in the development of the so-called Artificial Intelligence (AI) have started to raise ethical problems. These problems are of different kinds: on the one hand philosophers and scientists have started asking whether computers, once they reach a certain level of intelligence comparable with human beings, should be granted certain rights. On the other hand, there is the question of how to regulate AI in such a way that, in the pursuits of its goals, it be harmful to human beings.\nIn this course we will analyze these questions in order to 1) check their assumptions and understand on what kind of presuppositions these very assumptions are based, 2) try to elaborate new ways to approach the so-called AI and to formulate more productive questions out of a deeper understanding of the phenomenon.\nIn this course students will become aware of the state of the debate around AI as well as to enable them to formulate hypotheses that can propose a different approach to the problem. In order to do so, we will study the philosophical roots of the understanding of “intelligence” as well as of the “machine” that lies as the foundation of the way in which we currently think about AI. We will at the same time contrast this understanding with another hypothesis on what “intelligence” is.The ultimate goal of the course is to enable students to start developing an understanding of the actual potentials of computers that might go beyond the current one.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "instructor_first_name": "Paolo",
        "instructor_last_name": "Di Leo"
    },
    {
        "type": "HASS",
        "subject_code": "02.144DH",
        "title": "Being in the World: from Homer and Heidegger to A.I.",
        "description": "A.I. is the new frontier of technological progress. But far from being just another tool, A.I. has the potential to change the way in which we relate to the world and in which we understand ourselves. Yet, A.I. remains a human product and as such it is the result of a certain way in which human beings have interpreted themselves and the world through the course of history. In relation to this long cultural path, A.I. represents one of the possibilities through which the human being can relate to things and to itself.\nIn this course we want students to become aware of 1) the cultural passages that have led to the development of A.I., 2) the different possibilities present in those cultural passages, 3) the theoretical assumptions that are at the core of the way in which A.I. is being thought and developed.\nThe course is going to be co-taught by a philosopher, Dr. Paolo Di Leo, and an engineer, Prof. Costas Courcoubetis. This collaboration is going to ensure that while the theoretical and cultural aspects of A.I. are explored, attention be devoted also to the more specialized technical aspects, so that discussions and observations may be grounded on solid facts.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "instructor_first_name": "Paolo",
        "instructor_last_name": "Di Leo"
    },
    {
        "type": "HASS",
        "subject_code": "02.150HT",
        "title": "Cultures and Histories of the Digital",
        "description": "The course seeks to help students develop an understanding of how digital and computational technology and the social and cultural artifacts they enable are influenced by societies and cultures, and how societies and cultures, in turn, shape the conditions for the uptake of developments in information-processing by normalizing and fostering different habits of mind, attitudes and ways of thinking. The course will consist of readings, in various different media, of imaginative works — combined with some readings of a theoretical and philosophical nature that will help us engage with these texts. The course will be generally interdisciplinary, and focused particularly on the following: literary humanities, cultural history and cultural studies of the digital, broadly understood.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "instructor_first_name": "Sayan",
        "instructor_last_name": "Bhattacharyya"
    },
    {
        "title": "Environmental Humanities",
        "description": "The course seeks to help students develop an integrated understanding of environmental and ecological issues from the point of view of the humanities, broadly understood (incorporating literature, the arts, philosophy and cultural studies), in conjunction with technology. The course will consist of readings of excerpts from several imaginative works such as novels and stories, combined with some theoretical readings from non-fiction that help us engage with these texts. These readings will be combined with assignments involving both traditional essays and hands-on exploration of the students’ own geospatial environment in Singapore as case study, the latter to be documented with the help of user-centered digital mapping using tools and resources such as QGIS, GeoCommons and OpenStreetMaps.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "type": "HASS",
        "subject_code": "02.154HT",
        "instructor_first_name": "Sayan",
        "instructor_last_name": "Bhattacharyya"
    },
    {
        "type": "HASS",
        "subject_code": "02.155TS",
        "title": "Design Anthropology",
        "description": "When designers create something– whether an algorithm, a user interface, a technological device, a building, or a new urban plan – they actively intervene into the lived world of its users. But both designers and users are human beings enmeshed in varied social, cultural, and political worlds. As such, they bring different ideas and assumptions about things like value, beauty, social order, power, morality, and ethics into their creative and practical activities, including their reception or uptake of a designed form, object, space, or system. By focusing on the diversity and variability of human experience, the discipline of anthropology is well-situated to interrogate design as socio-culturally mediated act of human creativity. Issues like the formation of design problems through community engagement, the cultural embeddedness and historical novelty of a design process, empathy with users, and analysis and anticipation of user experiences (UX) all hinge on anthropological sensibilities and methods. To that end, this class develops an anthropological approach to design, which can equally inform how social scientists understand design and design processes, as well as designers’ and engineers’ reflexive and critical approaches to their own practices. For instance, how does qualitative engagement with people’s lived circumstances contribute to the formation of a design problem? How can designers try to anticipate unexpected critiques or problems with their design before they happen? How do political values, assumptions about social organization, moral goodness, and power get built into designs? How might a holistic view of social life inform the ethical commitments of designers in releasing a designed artifact, object, or entity into the world? What exactly are creativity and innovation, and are these even possible without a certain level of historical and cultural awareness?  Through curated readings and activities, this class provides students with the conceptual tools and analytical skills with which to reflexively engage with design, design thinking, and design processes as social and cultural phenomena. It introduces current and emerging ideas in design anthropological theory and practice, and explores how sensitive, ethical, and innovative design relies on social, historical, and cultural knowledge.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.\nAccess to Course Syllabus\n(Please ensure that you login to the eDimension portal before clicking the link)",
        "instructor_first_name": "Gabriel",
        "instructor_last_name": "Tusinski"
    },
    {
        "description": "This course is designed to build an understanding of how organizations behave and change by analyzing the workplace through different perspectives (or lenses).\nThe ability to act with skill and creativity in organizations begins with the development of multiple perspectives on organizations. Humans habitually settle into fixed perspectives, unchallenged mental models of how the world works, unconscious filters determining what we pay attention to and what we ignore. These habits offer powerful economies of thought: without them, the simplest task of picking a face out in a crowd or listening to the radio while driving would be impossible. But they impose ‘costs’ as well. They lock us into a single view of the world that may not be best, that is surely incomplete, resistant to change, and will become outdated. Overcoming organizational challenges requires the discipline of interpreting what we see and hear in organizations from multiple standpoints.\nAs a starting point, this course is organized around three different perspectives on organizations: the strategic design perspective, the cultural perspective, and the political perspective. Each of them offers a different angle on what is an organization, and each offers different ‘tools for action’. People naturally populate these organizations. Accordingly, we will probe some of the psychological and social processes that are at work in organizations. We will then turn to a more in‐depth treatment of the strategic design, political, and cultural perspectives on organization, and examine the implications of these insights for understanding the prospects and challenges of working in organizations.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.202",
        "title": "Organizational Processes",
        "type": "HASS",
        "instructor_first_name": "Grace",
        "instructor_last_name": "Dixon"
    },
    {
        "subject_code": "02.211",
        "type": "HASS",
        "title": "Critical Management Studies",
        "description": "‘Critical thinking’ has been touted as an essential skill in the workplace. However, what constitutes ‘critical thinking’ is often ambiguous. In this course, students will work through the stages of critical thinking and learn the basic principles of ‘clarity’, ‘precision’ and ‘reasoning’; culminating in a debate of complex, current issues affecting the workplace. This course is open to all pillars, but is specially designed for final year students who are interested in understanding management theory and contemporary management practices in a “VUCA” (volatile, uncertain, complex, ambiguous) environment.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "instructor_first_name": "Grace",
        "instructor_last_name": "Dixon"
    },
    {
        "title": "Introduction to Psychology",
        "type": "HASS",
        "description": "This course is an introduction to the study of psychology.  It is designed for students with a limited background in psychological studies and may serve as a foundation for more advanced level courses in psychology; however, it also serves students for whom this knowledge is a general contribution to a broad-based undergraduate education. Topics include research methods, biological basis of mind, learning, memory, thinking, language, intelligence, emotion, social influence, social cognition, altruism, human development, personality, and psychopathology.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.218",
        "instructor_first_name": "Yow",
        "instructor_last_name": "Wei Quin"
    },
    {
        "description": "This course introduces students to the social scientific study of human-environment interactions through the history and culture of a single agricultural crop: rice. The cultivation of rice dates back almost 10,000 years in Asia, and forms the core of an independent origin of civilization, distinct from other Eurasian sites that were all based around wheat/barley and millet. Some scholars hypothesize that the cultivation of rice also supports a distinctive Asian form of society, and mode of historical or technological development, that differs from standard frameworks of ‘Western’ modernization. Today rice is one of the most intensively researched crops, as both a model organism for advanced research in genomics and an important object of genetic modification experiments. We will explore how the cultivation of rice raises exciting and provocative questions about the relationships among society, technology and environment. The course asks whether Asia’s history and culture of rice can provide an alternative figure of technological development and design, and perhaps a model for a sustainable relationship between humans and their natural environments.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.219TS",
        "title": "Rice Cultures: Technology, Society and Environment in Asia",
        "type": "HASS",
        "instructor_first_name": "Lyle",
        "instructor_last_name": "Fearnley"
    },
    {
        "subject_code": "02.228TS",
        "type": "HASS",
        "title": "Design in the Anthropocene",
        "description": "The ‘Anthropocene’ refers to ‘(the) Age of Mankind’—the subsequent geological age after the Holocene that denotes the significant and unprecedented impacts of human actions on different global systems. The world in the Anthropocene is quintessentially, a ‘world as design’. Yet design studies have yet to be connected to, or contextualized within, the novel conditions that accompany the onset of the Anthropocene, when artificial design has unprecedentedly become the background, as well as the approach, for coordinating and supporting everyday life. What are the new categories for design in the Anthropocene? Furthermore, how do these categories and concepts modify, or even confound, what we already understand in design theory? What then are the new issues and challenges for design in the Anthropocene? In this course, existing design theory will be introduced, and explicated in relation to the Anthropocene condition through seven emerging topical issues: (i) designing with living systems 1 (human-beings); (ii) designing with living systems 2 (more-than-human agencies and other ecosystems); (iii) open systems and incomplete design; (iv) large-scale sociotechnical systems 1: Smart Cities; (v) large-scale sociotechnical systems 2: Artificial Intelligence; (vi) large-scale sociotechnical systems 3: Climate change adaptations; (vii) design ethics.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "instructor_first_name": "Jeffrey",
        "instructor_last_name": "Chan"
    },
    {
        "type": "HASS",
        "title": "Health Communication and Behavior Change",
        "description": "There is an increasing recognition of the role social and technological factors play in shaping the health and well-being of individuals. Communication, from the personal to mass and social media, have been demonstrated to have both beneficial and harmful effects on health and well-being. This course provides an introduction to the theory and practice of health communication and behavior change. It will cover the definition and history of health communication, the role of media and technology, social scientific theories used in health communication and behavior change, as well as how these theories can be applied to the real-world. The course will aim to bridge theoretical knowledge with real-world examples, and is suitable for students with varying interests, especially those who are interested in harnessing communication, design, and technology for better health and well-being in society.\nUnderstanding how and why facets of communication influence health outcomes is essential for students interested in developing effective technological and design solutions that improve health and well-being. Some questions we will tackle include: What social, environmental, and technological factors are effective in influencing people’s behavior? How should they be designed and molded? Can stories help people engage in healthier behaviors? How can technology and design help to foster better health and well-being in society?\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "subject_code": "02.230TS",
        "instructor_first_name": "Andrew",
        "instructor_last_name": "Yee"
    },
    {
        "title": "Transportation Technology and Policy in Urban Progress",
        "description": "This course introduces a conceptual framework for understanding real-world topics related to transportation technology and urban policy applications by examining a variety of international cases and development practices, including Singapore and other emerging economies in Asia, in a comparative manner. Particularly, the course tries to inspect and explain the dynamic and complex interplays between (i) evolving transportation technology, (ii) entrepreneurial state policy, and (iii) urban market progress/shrinkage on different network levels and/or geographic scales – macro, mezzo, and micro – in contemporary development and even prospect management contexts. Therefore, the “technologies” covered by this course are not only typical urban travel modes within cities (e.g., private automobile, public transit, and non-motorized transportation) but also extensive and unconventional interregional passenger, freight, and communication systems across cities (e.g., aviation, high-speed rail, worldwide e-commerce and e-logistics, and emerging smart applications). The urban influences of various transportation technologies in globalization as well as localization are widely reviewed from engineering, financial, economic, environmental, and social standpoints, and technological potentials and policy challenges are proactively discussed for upcoming applications in Asia’s urban development and management contexts.\n*Note: With the current CoV19 situation, the entire course and assessment will be online.",
        "type": "HASS",
        "subject_code": "02.231TS",
        "instructor_first_name": "Jin",
        "instructor_last_name": "Murakami"
    },
    {
        "type": "EPD",
        "description": "This course introduces students to statics and the mechanics of rigid bodies. Emphasis will be on the three basic principles of equilibrium, geometric compatibility, and material behavior. The course covers the topics related to the mechanics of materials. Mechanical properties of rigid and deformable bodies; analysis and design of beams and members of structures subjected to tension, compression, torsion, bending and combined stresses. Introduction to mechanical behavior of engineering materials, and the use of materials in mechanical design.",
        "title": "Structures & Materials",
        "subject_code": "30.001",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "The SUTD EPD pillar course, Circuits and Electronics, introduces the fundamentals of the lumped circuit abstraction. Topics include: resistive elements and networks; independent and dependent sources; switches and MOS transistors; digital abstraction; operational amplifiers; energy storage elements; dynamics of first and second order networks; design in the time and frequency domains; analog and digital circuits and applications. Design and lab exercises are significant components of the course.",
        "subject_code": "30.002",
        "type": "EPD",
        "title": "Circuits & Electronics",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.003",
        "type": "EPD",
        "title": "Introduction To Probability & Statistics",
        "description": "An introduction to statistics and probability covering essential topics. Sample space, discrete and continuous random variables, probability distributions, joint and conditional distributions, expectation, transformation of random variables, limit theorems, estimation theory, hypothesis testing, confidence interval, statistical tests, and regression.",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.007",
        "title": "Engineering Design Innovation",
        "type": "EPD",
        "description": "Students develop a holistic view and competency in the combined interactions of engineering design and engineering project management. Working in small teams, students carry out a design project targeting practical and functional devices. Students learn design, analysis, prototyping, testing, and project management methods to eﬀectively plan, organize, and execute an engineering project. Emphasis is placed on creativity, innovation, and the use of engineering analysis to reduce errors and iterations in the design process.",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.101",
        "description": "This course will provide students with the framework to understand, and the methods to model, analyze and design physical and engineering control systems. The topics include: Lumped parameter mathematical modelling and analysis of continuous time systems and signals in various disciplines using state-space and transfer function approaches and the Laplace transform. Analysis of linear time-invariant (LTI) systems and signals in time and frequency domains for synthesis and design of automatic feedback controllers.",
        "title": "Systems & Control",
        "type": "EPD",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Electromagnetics & Applications",
        "type": "EPD",
        "description": "This course focuses on electromagnetics (EM, Maxwell equations), the theories and applications. It includes\nTransmission line theory and circuit concepts of EM waves\nResonators and waveguides\nAntennas\nPlane waves\nWaves in different media and boundaries\nThe hands-on sections cover Matlab programming and commercial EM software (CST microwave studio). 1D project this year is wireless power transfer. 2D project is to apply EM to solve problems related to another discipline. The content from Physics 2 (10.005) will be recapped.",
        "subject_code": "30.102",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.103",
        "type": "EPD",
        "description": "This course will provide students with an introduction to the fundamental principles upon which an understanding and working knowledge of the behavior of fluids can be built. The course will familiarize students with important environmental and engineering challenges associated with fluid dynamics and introduce key elements for the study of fluid mechanics: properties of fluids, hydrostatics, equations of motion, control volume analysis, inviscid and viscous flows and dimensional analysis with the role of the Reynolds number. Many engineering designs require the application of fluid dynamic principles. The course will emphasize the role of fluid mechanics in design through examples in class, computational fluid dynamics (CFD) project and 2D project.",
        "title": "Fluid Mechanics",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.104",
        "description": "This course, particularly relevant for Mechanical, Aerospace and Robotics engineers, focuses on the dynamics of mechanical systems. The topics studied include: kinematics, force-momentum formulation for systems of particles and rigid bodies, work-energy concepts, virtual displacements and virtual work, Lagrange’s equations for systems of particles and rigid bodies, linearization of equations of motion, linear stability analysis, free and forced vibration of linear multi-degree of freedom models of mechanical systems. Emphasis is dedicated to the connection of these topics to realistic engineering problems thanks to “hands-on” and numerical design projects.",
        "title": "Dynamics",
        "type": "EPD",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "This subject provides advanced knowledge for designing key machine elements and mechanisms such as bearing, shafts, gears, and springs. It also provides analytical, heuristic and case-based knowledge to make machines as integrated systems of machine elements. Emphasis is on use of core engineering knowledge, including mechanics and materials, along with design principles to ensure the machine elements remain within operational limits while yet providing the necessary system level machine requirements. Students will work in small groups to analyze and size machine elements.",
        "type": "EPD",
        "subject_code": "30.105",
        "title": "Machine Element Design",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "Introduction to\nfundamental concepts in semiconductor physics, operations of key microelectronic devices, such as diodes, BJTs and MOSFETs).\nsmall signal analysis technique to understand the microelectronic circuits using microelectronic devices, such as single stage amplifier, differential amplifier, multi-stage amplifier.\nlarge signal analysis technique to understand the logic circuits using microelectronic devices, such as CMOS inverter.",
        "title": "Microelectronics Circuits and Devices",
        "subject_code": "30.106",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "The SUTD EPD pillar course, Power Electronics 30.107 addresses the application of electronics to energy conversion and control.  Topics covered include: characteristics of power semiconductor devices; modeling, analysis, and control techniques; design of power circuits including ac-ac regulator, inverters, rectifiers, and dc-dc converters; analysis and design of magnetic components and filters; interface between power electronics equipment and utility supply; and application to power supplies, motor drives, and green energy sources.\nThis subject is endorsed by PEB (Professional Engineers Board) Singapore.  It is an essential subject for electrical engineering, which fits into EPD Electrical Engineering Track curriculum and also requirement for a student in applying as a practicing engineer after graduation in Electrical Engineering.",
        "subject_code": "30.107",
        "title": "Power Electronics",
        "type": "EPD",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "subject_code": "30.108",
        "type": "EPD",
        "title": "Material Science",
        "description": "Fundamentals of structure and energetics that underpin materials science. Structure descriptors for crystalline and non-crystalline states.  The relationship between structure, processing, performance and properties of materials.  Materials selection for sustainable product design and to meet engineering requirements.",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Thermal Systems For Power & Environment",
        "type": "EPD",
        "description": "This course aims to extend the fundamental concepts of thermodynamics from that covered in Engineering in The Physical World to include phase-change processes, transient systems and the concept of useful work and irreversibility. This course also focuses on fundamental heat transfer processes such as steady state and transient conduction, forced and natural convection systems. These fundamental concepts are then applied to the design of processes and equipment.",
        "subject_code": "30.109",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "subject_code": "30.110",
        "description": "Lectures and labs are conducted on digital logic, flip flops, FPGAs, counters, and finite state machines. The subject prepares students for the design and implementation of a final project of their choice: games, music, digital filters, wireless communications, video, or graphics. It requires extensive use of Verilog to describe and implement digital system designs. Students engage in a group-based lab and project.",
        "title": "Digital Systems Laboratory",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "title": "Entrepreneurship",
        "description": "This course focuses on the social-technical factors and forces that affect the startup process, and the scientific principles underpinning the integrated product-process-people decisions under extreme uncertainty. In 30.111, students are expected to start up a new venture based on their design projects for experiential learning. In the past few years, Kickstarter campaigns have been used as the medium of the startup projects. Lectures, studio sessions, guest panel sharing sessions and readings aid experiential learning. 30.111 is supported by an “ecosystem” of entrepreneurs, venture capitalists, and designers.\nMore details on the activities, innovations and mentors from the classes in past few years can be found on the course website: www.tech-entrepreneurship.com.",
        "subject_code": "30.111",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "This course introduces design and fabrication of MEMS, including topics of material properties, micro-fabrication technologies, and basic principles of MEMS sensors and actuators, and applications. The first half term covers basic microfabrication techniques and process flow, MEMS materials and their properties, structural behavior and packaging. The second half term covers different sensing and actuating working principles (i.e. electrostatic, piezoelectric, piezoresistive, thermalcapacitive, microfluidics, etc.), design and analysis. A variety of MEMS device are analyzed including inertial sensors, pressure sensors, gyroscope, optical MEMS, and bioMEMS. In addition, throughout the course, a number of real-world applications are introduced and discussed. Hands-on lab sessions in cleanroom are significant components.",
        "subject_code": "30.113",
        "title": "Design and Fabrication of Microelectromechanical Systems (MEMS)",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "title": "Advanced Feedback and Control",
        "description": "Extending feedback control theory and applications (from 30.101 Systems & Control) to include multi-input & multi-output and discrete-time systems. Mathematical modeling and analysis of discrete time systems in various disciplines using state-space, pulse transfer function and z-transform. Relating controllability and observability and their canonical forms to synthesize and design advanced continuous and discrete-time controllers. Introduction of pole-placement based controller design and formulation of state observers.",
        "subject_code": "30.114",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "The aims of this course are to teach the students with digital signal principles and processing techniques. This course serves as a strong fundamental for digital signal processing with projects experience in audio processing and image processing.",
        "title": "Digital Signal Processing",
        "type": "EPD",
        "subject_code": "30.115",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Introduction to Nano-electronics",
        "type": "EPD",
        "description": "This course is not offered in 2020.\nTraditionally, progress in electronics has been driven by miniaturisation. When the dimension goes to nano-meter or the quantum materials were used, the traditional model of the electronics must be revised. As an introduction to nano-electronics, this class teaches the theory of current, voltage and resistance from bottom up. To describe physics at the nanoscale, we will begin with an introduction to the principles of quantum mechanics: including quantisation, the wave-particle duality, wave functions, Schrödinger’s equation, and electronic properties on nano-materials.\nWe will then compare the traditional MOSFETs with nano-scale transistors.",
        "subject_code": "30.116",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "This is a course in electric power systems. Topics include: overview of electric transmission and distribution networks; ac transmission lines and cable systems; fundamental principles of major power system components – generators, transformers and motors; characteristics and requirements of power system loads; power system operation and control; earthing and safety requirements; faults in power system and protection; design of industrial and commercial distribution for mission-critical facilities; reliability analysis, risk assessment, safety and maintainability considerations; power quality and interface issues with renewable and alternative energy sources.\nThis subject is endorsed by PEB (Professional Engineer Board) Singapore.  It is an essential subject for electrical engineering, which fits into EPD Electrical Engineering Track curriculum and also requirement for a student in applying as a practicing engineer after graduation in Electrical Engineering.",
        "subject_code": "30.117",
        "type": "EPD",
        "title": "Electric Power Systems Analysis and Design",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Optical Engineering & Communications",
        "description": "This course is not offered in 2020.\nThis is an introductory optics course that will cover the theory and design principles of optics and photonics with an emphasis on applications. Optical communication systems, lightwave system components, multichannel systems, fiber optics will be covered. The course outline includes the following:\nIntroduction\nOptical Signal Generation: Lasers/Transmitters\nSignal Propagation in Fibers\nImpairment in Fibers\nLoss Management: Optical Amplifiers\nDispersion Management Techniques\nImpairment Management\nMultichannel Lightwave Systems\nOptical Networks",
        "type": "EPD",
        "subject_code": "30.118",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "This subject provides an overview of robot mechanisms, dynamics, and intelligent controls. Topics include planar and spatial kinematics, and motion planning; mechanism design for manipulators and mobile robots; multi-body dynamics; control design, actuators, and sensors; sensing and perception to enable intelligent behavior; and computer vision. Weekly laboratories provide experience with servo drives, real-time control, task modelling and embedded software. Students will build working robotic systems in a group-based term project.",
        "subject_code": "30.119",
        "title": "Intelligent Robotics",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "This subject provides exposure to a range of current industrial processes and practices used to manufacture products in high and low volumes, with in-depth focus on several selected processes. It gives an integrated perspective of design, engineering, and management disciplines and practices for analysis and design of manufacturing enterprises. Emphasis is on the physics and stochastic nature of manufacturing processes and systems, and their effects on quality, rate, cost, and flexibility. Topics include process physics and control, design for manufacturing, and manufacturing systems. Group project requires design and fabrication of parts using mass-production and assembly methods to produce a product in quantity.",
        "title": "Design & Manufacturing",
        "subject_code": "30.120",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Healthcare Product Design",
        "type": "EPD",
        "description": "This project-based design course aims to teach the students in developing fundamentals of the design aspects of biomedical and healthcare devices and diagnostics. The course has been designed to educate students to solve real-life clinical problems using their engineering knowledge by designing and developing biomedical products that can be ranging from devices, in-vitro diagnostic kits, and instruments.\nDuring the first week of class, students for project teams (~3-4 students per team) to carry out a design project to solve a clinical problem (identified and proposed by healthcare professionals). Case studies of biomedical device designs and hands-on prototyping sessions are used extensively throughout the course. These, as well as guest lectures (clinicians and MedTech start-up experts), discussion sections, and design reviews, are designed to encourage students to consider the broader social and clinical contexts of engineering and design. Emphasis will be on the development of creative and innovative designs that are motivated by qualitative and quantitative analytical models. There will also be lectures on specific aspects pertinent to medical devices including regulatory, safety, and testing requirements and design control guidance.\nDesign activities include: (i) understand and document the clinical challenge, needs, users, and environment (meet clinical mentor and observe the problem by yourself at the hospital), (ii) develop technical and functional requirements and design specifications, generate and select design concepts, and (iii) perform design calculations, optimize the design, and necessary design trade-offs, and (iv) experimental prototyping and requirements verification testing. This course will have a significant communication component as students will present ideas in class, to the medical community, and to designers and engineers at SUTD.\nAt the end of the course, students would have gained the knowledge needed to design and develop healthcare products, acquired an understanding of fundamental principles of design process and aspects of biomedical devices and diagnostics, and learned how to execute a successful healthcare product design and development by avoiding common quality and regulatory issues.",
        "subject_code": "30.123",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "description": "This subject introduces students to key micro-fabrication and nano-engineering techniques that serve as a “toolbox” for product design in the micro/nano-technology area. Concepts, ideas and enabling tools of micro/nano-technologies are taught through hands-on intensive lab modules, which include microfluidics, micro and nano-patterning, nanomaterials and molecular scale imaging tools. Students will learn to operate some common instruments in the area of micro/nano-technology (e.g. UV exposure, plasma treatment machine, upright and inverted fluorescence microscope, nanoimprinter, scanning electron microscope), make micro/nano-scale devices and structures, perform experimental observation and improve experimental set-ups. The course is highly interdisciplinary in the development of integrative thinking of fundamental science and engineering knowledge curriculum through building, observing and manipulating objects at the micro and nano-scale. Students will have a broad view on how micro/nano-technologies are being advanced, and their huge impact on biomedical and precise manufacturing applications.",
        "subject_code": "30.200",
        "title": "Micro-Nano Projects Laboratory",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Wireless Communications and Internet of Things",
        "subject_code": "30.201",
        "description": "* This course is not offered in 2018.\nThis course is an introduction to the design and analysis of wireless communications systems and internet-of-things. Students will understand the basic fundamental challenges, and study state-of-the-art technologies, in terms of internet-of-things system architecture, signaling protocol, and wireless communications techniques.  Students will build a working cloud-connected wireless internet-of-things smart systems in a group-based lab and project.",
        "type": "EPD",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Design of Intelligent Digital Integrated Circuits and Systems",
        "type": "EPD",
        "description": "30.202 Design of Intelligent Digital Integrated Circuits and Systems examines the device and circuit level optimization of digital building blocks. Topics covered include: MOS device models including Deep Sub-Micron effects; circuit design styles for logic, arithmetic and sequential blocks; estimation and minimization of energy consumption; interconnect models and parasitic; device sizing and logical effort; timing issues (clock skew and jitter) and active clock distribution techniques; memory architectures, circuits (sense amplifiers) and devices; testing of integrated circuits. The course employs extensive use of circuit layout and SPICE in design projects and software labs.\nNew topics such as machine learning, and cryptography are covered also for system level design.",
        "subject_code": "30.202",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "This course will introduce students to the broad discipline of biomedical engineering, and the fundamental life science and engineering principles associated with biomedical systems and healthcare delivery. The course focuses on three key application areas of biomedical implants, instrumentation, and diagnostics, and will familiarize students with the theoretical and practical considerations relevant to the design and development of biomedical devices, tools, and systems in these areas.",
        "subject_code": "30.203",
        "type": "EPD",
        "title": "Topics in Biomedical and Healthcare Engineering",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "type": "EPD",
        "title": "Structural Mechanics and Design",
        "description": "This course presents a solid foundation of the fundamentals of structural mechanics, from the macro-level of structural analysis to the molecular level of materials science and engineering. Students will learn and appreciate how structural analysis and materials response are intricately involved in the engineering product/device design process. Fundamental concepts of  materials failures (including fracture, fatigue and creep) and their microstructural origins (in important engineering materials including metals, ceramics, polymers and composite – be it structural or elemental) will be introduced in the class, with emphasis on structural design for safety and reliability. In these aspects, the class could be likened to the popular CSI (Crime Scene Investigation) TV series where in every episode, the students will be presented with the “dead bodies in the crime scene” (ie. the failed components of an engineering systems/devices) and based on the “forensic knowledge”, they will be asked to “solve the case” (ie. based on structural mechanics knowledge, the students of this class will solve how the engineering systems/devices fail and how that led to the final catastrophic events that result in the failed parts found in the accident scene). Relevant principles and concepts in several applications – from design of large mechanical structures in civil engineering, to transportation (aerospace, automotive, etc.), to marine as well as high technology often in micro/nano-scale  (microelectronics, energy, solar PV, battery, etc.) industries – will be discussed. Throughout the course, emphasis will be placed on the foundations of structural mechanics, relevant design applications in the various fields of industries in Singapore, problem-solving, experimental design, and data analysis.",
        "subject_code": "30.207",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "description": "Industry 4.0 and 3D printing is a new course in EPD pillar, which will be offered in the spring of 2021.\nThe latest industrial revolution is named as Industry 4.0, which is defined as the combination of smart manufacturing systems and developed information technologies. The success model of Industry 4.0 is enabled by a group of tools such as cloud computing, machine learning, big data, internet of things and cyber physical systems. This course will bring an overall understanding of Industry 4.0 and its revolutionary implications to smart manufacturing, smart products/services and smart cities. The implementation, opportunities and challenges of Industry 4.0 will also be discussed. The powerful change in production techniques will require the extensive use of digital intelligence in the entire production process. As one of the important manufacturing methods of Industry 4.0, additive manufacturing (AM) or three-dimensional (3D) printing will be introduced in the second part of course. 3D printing offers numerous benefits to a smart factory, such as high production efficiency, time and material saving, rapid prototyping, and decentralized production methods. Our course will provide a comprehensive study on the liquid, solid and powder-based 3D printing methods. The course will also offer insights on the applications and future trend of 3D printing.",
        "title": "Industry 4.0 & 3D Printing",
        "type": "EPD",
        "subject_code": "30.303",
        "instructor_first_name": "",
        "instructor_last_name": ""
    },
    {
        "title": "Digital Biomimetics: Sustainable Materials and Manufacturing",
        "subject_code": "30.316",
        "type": "EPD",
        "description": "The course is a cross-disciplinary collaboration between Architecture and Sustainable Design and Engineering Product Development. It brings together material science and digital fabrication, fusing natural composites with industrial robotics, aiming to produce innovation in the realm of sustainable design and manufacturing. It suggests that designs inspired by biological processes found in nature, may assist in transforming society toward a more environmentally benign mode of production from the ground up. This process starts from the understanding of the principles behind structural biological systems and the development of tools embracing the paradigm imposed by nature instead of those predefined by the existing manufacturing technologies. As a research and design course, students are required to develop their own proposals, methods and artifact which may lead to publication of results in journals and conferences.",
        "instructor_first_name": "",
        "instructor_last_name": ""
    }
]